#Розробити програму, яка: а) створює текстовий файл TF13_1 із символьних рядків різної довжини, слова в яких розділені пробілами і розділовими знаками;
# б) читає вміст файла TF13_1, знаходить слова, які розпочинаються голосною літерою і записує кожне в окремий рядок файла TF13_2;
# в) читає вміст файла TF13_2 і друкує його по рядках.
import os

file_path = os.path.abspath("TF13_1.txt")
print("Повний шлях до файлу:", file_path)

def Open(file_name, mode):
    try:
        file = open(file_name, mode)
    except:
        print("Файл", file_name, "не відкрився!")
        return None
    else:
        print("Файл", file_name, "відкрився успішно")
        return file

file1_name = "TF13_1.txt"
file2_name = "TF13_2.txt"
file_1_w = Open(file1_name, "w")

if(file_1_w != None):
    file_1_w.write("просто якийсь рандомний текст, написаний зараз, під час виконання цієї лабораторної роботи, для того,"
                   " аби внести його у файл для подальшої роботи з ним, а саме пошуку слів, що починаються на голосну літеру, "
                   "і після цього записати їх у окремий інший файл, записуючи кожне нове слово з нового рядка. "
                   "Як нагадування для читача, голосних літер в укарїнській мові всього 6, та "
                   "ніяка інша літера не є голосною, як це здається на перший погляд, але це помилкове твердження. Ось так)")

    print("Текст був успішно доданий до TF13_1.txt!")
    file_1_w.close()
    print("Файл TF13_1.txt закрився")

file_2_r = Open(file1_name, "r")
file_2_w = Open(file2_name, "w")

if file_2_r != None or file_2_w != None:
    for block in file_2_r.read().split(", "):
        for word in block.split(" "):
          if word.lower().startswith(("а", "е", "и", "і", "о", "у")): #використав функцію startswith для перевірки того, чи починається слово рядка з великої літери, чи ні
             file_2_w.write(word + '\n')

    file_2_r.close()
    file_2_w.close()

    print("Файли закрилися!")
print("Оновлення файлу:")

file_3_r = Open(file2_name, "r")
print("Текст лише зі слів, що починаються на голосні літери:")

if file_3_r != None:
    for line in file_3_r.read().split():
        print(line)
    print("Файл TF13_2.txt закрився")

    file_3_r.close()